## Production: system_status
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_lambda_function_event_invoke_config.system_status_invoke_config` |
|        | `aws_lambda_permission.allow_cloudwatch[0]`                           |
|        | `module.system_status.aws_lambda_function.this`                       |
| update | `aws_cloudwatch_event_target.system_status[0]`                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.system_status[0] will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "system_status" {
      ~ arn            = "arn:aws:lambda:ca-central-1:296255494825:function:system_status" -> (known after apply)
        id             = "system_status_testing-terraform-20240109170915834300000001"
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function_event_invoke_config.system_status_invoke_config will be created
  + resource "aws_lambda_function_event_invoke_config" "system_status_invoke_config" {
      + function_name                = "system_status"
      + id                           = (known after apply)
      + maximum_event_age_in_seconds = 120
      + maximum_retry_attempts       = 0
    }

  # aws_lambda_permission.allow_cloudwatch[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "system_status"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:ca-central-1:296255494825:rule/system_status_testing"
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.system_status.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "system_status"
      + id                             = (known after apply)
      + image_uri                      = "296255494825.dkr.ecr.ca-central-1.amazonaws.com/notify/system_status:bootstrap"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::296255494825:role/system_status"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "sqlalchemy_database_reader_uri" = (sensitive value)
              + "system_status_admin_url"        = "https://notification.canada.ca"
              + "system_status_api_url"          = "https://api.notification.canada.ca"
              + "system_status_bucket_name"      = "notification-canada-ca-production-system-status"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-09e3175f46bc85607",
            ]
          + subnet_ids                  = [
              + "subnet-003252752c8a83c9f",
              + "subnet-0372dd9f5c68cdf14",
              + "subnet-0c68946095ba18faf",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.system_status_testing[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.system_status_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-system_status-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-system_status-api[0]"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
